Revit 2027 API
AssetPropertyFloatArray Class
 Represents a property consisting of an array of float values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyFloatArray : AssetProperty
Public Class AssetPropertyFloatArray
	Inherits AssetProperty
public ref class AssetPropertyFloatArray : public AssetProperty
type AssetPropertyFloatArray =
    class
        inherit AssetProperty
    end
The AssetPropertyFloatArray type exposes the following members.
Properties
Name | Description
IsReadOnly |  Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
(Inherited from AssetProperty)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssetProperty)
Name | Get the name of the AssetProperty
(Inherited from AssetProperty)
NumberOfConnectedProperties |  The number of currently connected properties.
(Inherited from AssetProperty)
Type | Returns the type of the AssetProperty
(Inherited from AssetProperty)
Top
Methods
Name | Description
AddConnectedAsset |  Adds a new connected asset attached to this asset property, if it allows it.
(Inherited from AssetProperty)
AddCopyAsConnectedAsset |  Makes a copy of the asset and connects it to this property.
(Inherited from AssetProperty)
Dispose
(Inherited from AssetProperty)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAllConnectedProperties |  Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
(Inherited from AssetProperty)
GetConnectedProperty |  Gets one connected property with specified index.
(Inherited from AssetProperty)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSingleConnectedAsset |  Gets the single connected asset attached to this asset property, if it exists.
(Inherited from AssetProperty)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetValue | Get the value of the property.
IsEditable |  Check if property can be edited.
(Inherited from AssetProperty)
IsValidSchemaIdentifier |  Check that schema name is valid
(Inherited from AssetProperty)
RemoveConnectedAsset |  Removes the connected asset attached to this asset property if any.
(Inherited from AssetProperty)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 In virtually all cases, the array will contain exactly 3 values.
See Also
Reference
Autodesk.Revit.DB.Visual Namespace